#include "Weapon.hpp"

// -----------------------------------------------------------------------------
// OCF
// -----------------------------------------------------------------------------

Weapon::Weapon(std::string type) : type (type) {}

Weapon::~Weapon() {}

// -----------------------------------------------------------------------------
// メンバ関数
// -----------------------------------------------------------------------------

const std::string& Weapon::getType(void) const {
    return this->type;
}

void Weapon::setType(std::string type) {
    this->type = type;
}
